content-org/all-posts.org
#+setupfile: setup.org
#+hugo_section: post
#+seq_todo: TODO DRAFT DONE
#+hugo_front_matter_key_replace: lastmod>mylastmod
#+hugo_front_matter_format: yaml
#+macro: unsplash @@hugo:{{< unsplash leading="$1" id="$2" name="$3" >}}@@
#+macro: pixabay @@hugo:{{< pixabay >}}$1{{< /pixabay >}}@@
#+macro: pexels @@hugo:{{< pexels leading="$1" id="$2" name="$3">}}@@
#+macro: lastmod @@hugo:{{< lastmod >}}@@
#+macro: begin_callout @@hugo:{{% callout $1 %}}@@
#+macro: end_callout @@hugo:{{% /callout %}}@@
#+macro: toc @@html:{{< toc >}}@@

** DONE consult-ripgrep と migemo を組み合わせて ripgrep でもローマ字日本語検索 :migemo:ripgrep:consult:emacs:
CLOSED: [2022-02-07 月 23:29]
:PROPERTIES:
:EXPORT_FILE_NAME:   index
:EXPORT_DATE:        2022-02-07
:DIR:                images/2022-02-07_consult-ripgrep-migemo
:EXPORT_HUGO_BUNDLE: 2022-02-07_consult-ripgrep-migemo
:EXPORT_HUGO_SLUG:   consult-ripgrep-migemo
:END:

[[/2022/02/07/consult-ripgrep-migemo/][consult-ripgrep と migemo を組み合わせて ripgrep でもローマ字日本語検索]] の派生。

*** TL;DR

#+begin_src emacs-lisp
(defun consult--migemo-regexp-compiler (input type)
  (setq input (mapcar #'migemo-get-pattern (consult--split-escaped input)))
  (cons (mapcar (lambda (x) (consult--convert-regexp x type)) input)
        (when-let (regexps (seq-filter #'consult--valid-regexp-p input))
          (lambda (str)
            (consult--highlight-regexps regexps str)))))
(setq migemo-options '("--quiet" "--nonewline" "--emacs"))
(setq consult--regexp-compiler #'consult--migemo-regexp-compiler)
#+end_src

*** =cosult-ripgrep= の仕組み

=consult-ripgrep= で指定する文字列は、 [[https://github.com/minad/consult/blob/1a6ed29e92f00266daff4ff5f62602f53ef7d158/consult.el#L4311-L4318][こちら]] にあるように構造化されている。

特に =#first#second= といった指定の場合に、
デフォルトでは区切り文字の前半(例の =first= の部分)は基本的にそのまま =rg= に渡され、
後半(例の =second= の部分)は =rg= の結果について更に Emacs 上で絞り込む、といった挙動になる
( 基本的に、と書いたのは Emacs の正規表現から =rg= に渡せる正規表現に変換してくれるという
=counsel-rg= と同じ似たような機構が備わっているから。[[https://github.com/minad/consult/blob/1a6ed29e92f00266daff4ff5f62602f53ef7d158/consult.el#L571-L590][この辺]] )。

後者については [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Completion-Styles.html][=completion-styles=]] の指定通りの補完スタイルが適用される為、
[[https://nyoho.jp/diary/?date=20210615][consultをmigemoizeしたい (未完→だいたいできた) - ワタタツの日記!(2021-06-15)]] の記事にあるように
=completion-styles= を設定していれば migemo が使用されるが、
前者については =consult-ripgrep= 独自の仕組みなので =completion-styles= には影響されない。

*** =consult--regexp-compiler=

[[https://github.com/minad/consult/blob/1a6ed29e92f00266daff4ff5f62602f53ef7d158/consult.el#L4306-L4309][consult-grep の DOCSTRING]] に以下の記載がある:

#+begin_quote
In order to disable transformations of the grep input, adjust `consult--regexp-compiler' accordingly.
#+end_quote

[[https://github.com/minad/consult/blob/1a6ed29e92f00266daff4ff5f62602f53ef7d158/consult.el#L592-L602][デフォルトの実装]] はこんな感じ:

#+begin_src emacs-lisp
(defun consult--default-regexp-compiler (input type)
  "Compile the INPUT string to a list of regular expressions.
The function should return a pair, the list of regular expressions and a
highlight function. The highlight function should take a single argument, the
string to highlight given the INPUT. TYPE is the desired type of regular
expression, which can be `basic', `extended', `emacs' or `pcre'."
  (setq input (consult--split-escaped input))
  (cons (mapcar (lambda (x) (consult--convert-regexp x type)) input)
        (when-let (regexps (seq-filter #'consult--valid-regexp-p input))
          (lambda (str)
            (consult--highlight-regexps regexps str)))))
#+end_src

入力文字列から最終的に =rg= に渡される文字列を組み立てているここに、介入余地がある。

ということで、冒頭のような設定を行い、 migemo 対応版の =consult--regexp-compiler= を指定してやればよい。

{{{begin_callout(warning)}}}
=consult--regexp-compiler= はその命名からも分かる通り、あくまで内部変数のようである。
その為、今後の更新によって使えなくなる可能性も十分にある。
{{{end_callout}}}

